<template>
    <div id="demo" :style="{height:insertHeight}">


        <div class="rContainer">
            <div ref="demoMap" id="demoMap"></div>
        </div>
    </div>
</template>
<script>
    import echarts from 'echarts'
    import './js/world.js'  //'echarts/map/js/world.js'
    //npm install echarts --save  第一步 上面第二步引入

    export default {
        name: 'demo',
        data() {
            return {
                insertHeight: '',
                geoCoordMap: {//全名版
                    '中华人民共和国': [130.0823, 34.2568],
                    '斐济群岛共和国': [213.414413,-23.078193],
                    '新西兰': [210.885971,-48.400557],
                    '澳大利亚联邦': [163.959158,-30.376706],
                    '印度利西亚': [138.959158,-4.376706],
                    '巴布亚新几内亚独立国': [173.959158,-9.876706],
                    '马来西亚': [136.959158,2.376706],
                    '菲律宾共和国': [148.959158,11.376706],
                    '日本国': [165.959158,41.376706],
                    '大韩民国': [152.959158,40.376706],
                    '朝鲜民主主义人民共和国': [152.959158,45.376706],
                    '越南社会主义共和国': [129.999158,11.376706],
                    '柬埔寨王国': [125.999158,12.376706],
                    '泰王国': [120.999158,15.376706],
                    '老挝人民民主共和国': [122.999158,21.376706],
                    '缅甸联邦': [114.999158,23.376706],
                    '孟加拉人民共和国': [108.999158,26.376706],
                    '不丹王国': [108.999158,30.876706],
                    '尼泊尔王国': [100.999158,30.876706],
                    '印度共和国': [93.999158,23.876706],
                    '巴基斯坦伊斯兰共和国': [80.999158,31.876706],
                    '克什米尔-巴': [88.999158,39.876706],
                    '克什米尔-印': [91.999158,37.376706],
                    '塔吉克斯坦共和国': [83.999158,43.376706],
                    '阿富汗': [79.199158,39.676706],
                    '土库曼斯坦': [71.199158,44.676706],
                    '乌兹别克斯坦共和国': [74.199158,48.276706],
                    '吉尔吉斯共和国': [88.899158,46.776706],
                    '哈萨克斯坦共和国': [84.899158,54.776706],
                    '伊朗伊斯兰共和国': [64.899158,34.776706],
                    '阿塞拜疆共和国': [56.899158,45.776706],
                    '亚美尼亚共和国': [54.899158,45.776706],
                    '格鲁吉亚': [52.199158,47.776706],
                    '土耳其共和国': [46.199158,43.776706],
                    '阿拉伯叙利亚共和国': [46.199158,38.776706],
                    '伊拉克共和国': [54.199158,35.776706],
                    '黎巴嫩共和国': [42.199158,36.776706],
                    '巴勒斯坦国': [42.199158,36.176706],
                    '约旦哈希姆王国': [43.129158,35.276706],
                    '以色列国': [42.199158,35.776706],
                    '沙特阿拉伯王国': [53.199158,27.776706],
                    '也门共和国': [56.199158,16.276706],
                    '阿曼苏丹国': [68.199158,22.276706],
                    '阿拉伯埃及共和国': [37.199158,29.276706],
                    '厄立特里亚国': [45.199158,16.276706],
                    '突尼斯共和国': [12.199158,39.276706],
                    '大阿拉伯利比亚人民社会主义民众国': [22.199158,29.276706],
                    '阿尔及利亚民主人民共和国': [4.199158,27.276706],
                    '摩洛哥王国': [-6.199158,37.276706],
                    '西撒哈拉': [-16.199158,27.276706],
                    '毛里塔尼亚伊斯兰共和国': [-12.199158,21.276706],
                    '马里共和国': [-3.199158,20.276706],
                    '尼日尔共和国': [11.199158,19.276706],
                    '乍得共和国': [23.199158,16.276706],
                    '苏丹共和国': [36.199158,16.276706],
                    '埃塞俄比亚联邦民主共和国': [48.199158,9.276706],
                    '索马里共和国': [56.199158,2.276706],
                    '肯尼亚共和国': [45.199158,-3.276706],
                    '乌干达共和国': [39.199158,-1.276706],
                    '南苏丹': [36.199158,5.276706],
                    '中非共和国': [26.199158,5.276706],
                    '喀麦隆共和国': [15.199158,3.276706],
                    '尼日利亚联邦共和国': [8.199158,7.276706],
                    '赤道几内亚共和国': [13.199158,-1.276706],
                    '加蓬共和国': [13.199158,-3.276706],
                    '刚果共和国': [19.199158,-3.276706],
                    '刚果民主共和国': [27.199158,-5.276706],
                    '卢旺达共和国': [36.199158,-5.276706],
                    '布隆迪共和国': [36.199158,-7.276706],
                    '坦桑尼亚联合共和国': [41.199158,-9.276706],
                    '莫桑比克共和国': [46.199158,-19.276706],
                    '马拉维共和国': [41.199158,-19.276706],
                    '赞比亚共和国': [32.199158,-20.876706],
                    '安哥拉共和国': [21.199158,-17.276706],
                    '纳米比亚共和国': [19.199158,-27.276706],
                    '博茨瓦纳共和国': [30.199158,-29.276706],
                    '津巴布韦共和国': [36.199158,-25.276706],
                    '马达加斯加共和国': [58.199158,-25.276706],
                    '南非共和国': [28.199158,-38.276706],
                    '莱索托王国': [33.199158,-38.276706],
                    '斯威士兰王国': [38.199158,-35.276706],
                    '布基纳法索': [-0.999158,12.276706],
                    '贝宁共和国': [3.199158,9.276706],
                    '多哥共和国': [0.999158,8.276706],
                    '加纳共和国': [-1.199158,7.276706],
                    '科特迪瓦共和国': [-6.199158,7.276706],
                    '利比里亚共和国': [-11.199158,4.276706],
                    '塞拉利昂共和国': [-14.199158,7.276706],
                    '几内亚共和国': [-13.199158,10.276706],
                    '几内亚比绍共和国': [-17.199158,11.276706],
                    '塞内加尔共和国': [-17.199158,14.276706],
                    '巴西联邦共和国': [-58.895168, -20.2312],
                    '苏里南共和国': [-66.895168, 3.2312],
                    '圭亚那合作共和国': [-70.675168, 4.2312],
                    '委内瑞拉共和国': [-77.895168, 8.2312],
                    '哥伦比亚共和国': [-88.895168, 2.2312],
                    '厄瓜多尔共和国': [-93.895168, -3.7312],
                    '秘鲁共和国': [-90.895168, -10.2312],
                    '玻利维亚共和国': [-77.895168, -24.2312],
                    '阿根廷共和国': [-77.895168, -48.2312],
                    '智利共和国': [-84.895168, -40.2312],
                    '巴拉圭共和国': [-69.895168, -30.2312],
                    '乌拉圭东岸共和国': [-65.895168, -43.2312],
                    '美利坚合众国': [-120.895168, 50.2312],
                    '巴拿马共和国': [-94.895168, 7.2312],
                    '哥斯达黎加共和国': [-99.895168, 9.2312],
                    '尼加拉瓜共和国': [-100.995168, 12.6312],
                    '萨尔瓦多共和国': [-105.895168, 13.7312],
                    '洪都拉斯共和国': [-102.895168, 15.2312],
                    '危地马拉共和国': [-107.895168, 16.2312],
                    '伯利兹': [-105.895168, 17.6312],
                    '墨西哥合众国': [-124.895168, 28.2312],
                    '古巴共和国': [-95.895168, 23.2312],
                    '巴哈马联邦': [-93.895168, 27.2312],
                    '牙买加': [-93.195168, 19.2312],
                    '海地共和国': [-86.895168, 21.2312],
                    '多米尼加共和国': [-83.895168, 19.2312],
                    '波多黎各': [-80.195168, 18.6312],
                    '加拿大': [-130.895168, 70.2312],
                    '格陵兰': [-50.895168, 80.2312],
                    '冰岛共和国': [-20.895168, 74.9312],
                    '挪威王国': [10.895168, 71.2312],
                    '法兰西共和国': [4.895168, 52.370216],
                    '瑞典王国': [21.895168, 74.2312],
                    '芬兰共和国': [32.895168, 76.2312],
                    '爱沙尼亚共和国': [30.895168, 68.2312],
                    '拉脱维亚共和国': [30.895168, 65.8312],
                    '立陶宛共和国': [28.895168, 63.8312],
                    '白俄罗斯共和国': [32.895168, 61.2312],
                    '乌克兰': [36.895168, 56.2312],
                    '摩尔多瓦共和国': [33.895168, 53.8312],
                    '罗马尼亚': [30.895168, 52.2312],
                    '保加利亚共和国': [30.595168, 48.8312],
                    '希腊共和国': [27.895168, 45.2312],
                    '马其顿': [25.895168, 46.8312],
                    '阿尔巴尼亚共和国': [24.395168, 46.6312],
                    '塞尔维亚': [25.695168, 49.8312],
                    '黑山': [23.895168, 48.2312],
                    '波斯尼亚和黑塞哥维那': [21.895168, 49.7312],
                    '波兰共和国': [22.895168, 60.2312],
                    '德意志联邦共和国': [11.895168, 60.8312],
                    '捷克共和国': [17.895168, 57.2312],
                    '斯洛伐克共和国': [22.895168, 56.2312],
                    '匈牙利共和国': [23.895168, 54.2312],
                    '克罗地亚共和国': [19.895168, 52.2312],
                    '斯洛文尼亚共和国': [18.895168, 52.8312],
                    '奥地利共和国': [17.895168, 54.2312],
                    '瑞士联邦': [9.895168, 53.2312],
                    '意大利共和国': [14.895168, 48.2312],
                    '荷兰王国': [6.895168, 60.2312],
                    '比利时王国': [5.295168, 58.2312],
                    '大不列颠及北爱尔兰联合王国': [-2.895168, 64.2312],
                    '爱尔兰': [-8.895168, 60.2312],
                    '西班牙王国': [-6.895168, 48.2312],
                    '葡萄牙共和国': [-8.895168, 46.2312],
                    '俄罗斯联邦': [110.0823, 66.2568],
                    '蒙古国': [118.0823, 54.2568],
                    '福克兰群岛（马尔维纳斯）': [-71.895168, -65.2312],
                    '法罗群岛': [-8.895168, 71.2312],
                    '法属圭亚那': [-63.675168, 2.2312],
                    '法属波利尼西亚': [-159.675168, -38.2312],
                    '法属南部领地': [11.895168, 47.8312],
                    '冈比亚共和国': [-17.899158,11.676706],
                    '直布罗陀': [-8.199158,40.276706],
                    '格林纳达': [-74.895168, 11.2312],
                    '瓜德罗普': [-74.895168, 15.2312],
                    '关岛': [173.959158,19.876706],
                    '赫德岛和麦克唐纳岛': [80.999158,-55.876706],
                    '印度尼西亚共和国': [145.999158,-4.876706],
                    '基里巴斯共和国': [206.999158,-15.876706],
                    '科威特国': [57.199158,32.776706],
                    '列支敦士登公国': [11.895168, 53.7312],
                    '卢森堡大公国': [7.295168, 57.2312],
                    '前南斯拉夫马其顿共和国': [26.895168, 46.8312],
                    '斯里兰卡民主社会主义共和国': [96.999158,5.876706],
                    '马尔代夫共和国': [88.895168, 0.8312],
                    '马耳他共和国': [17.199158,39.276706],
                    '马绍尔群岛共和国': [206.959158,-1.876706],
                    '马提尼克': [-74.895168, 14.2312],
                    '毛里求斯共和国': [69.199158,-26.276706],
                    '马约特': [54.199158,-18.276706],
                    '密克罗尼西亚联邦': [192.959158,3.876706],
                    '摩纳哥公国': [9.895168, 50.2312],
                    '蒙特塞拉特': [-76.895168, 18.2312],
                    '瑙鲁共和国': [198.959158,-6.876706],
                    '荷属安的列斯': [-75.195168, 18.6312],
                    '新喀里多尼亚': [198.959158,-28.176706],
                    '纽埃': [210.959158,-28.176706],
                    '诺福克岛': [204.959158,-34.176706],
                    '北马里亚纳自由联邦': [175.959158,11.376706],
                    '帕劳共和国': [161.959158,3.376706],
                    '皮特凯恩': [-150.895168, -30.2316],
                    '卡塔尔国': [61.499158,27.776706],
                    '留尼汪': [65.199158,-28.276706],
                    '圣赫勒拿': [-15.199158,-19.276706],
                    '圣基茨和尼维斯联邦': [-79.195168, 16.6312],
                    '圣卢西亚': [-74.195168, 12.6312],
                    '圣皮埃尔和密克隆': [-66.195168, 52.6312],
                    '圣文森特和格林纳丁斯': [-74.195168, 15.6312],
                    '萨摩亚独立国': [220.414413,-20.078193],
                    '圣马力诺共和国': [15.895168, 50.2312],
                    '圣多美和普林西比民主共和国': [8.199158,-2.976706],
                    '塞舌尔共和国': [65.199158,-9.276706],
                    '新加坡共和国': [124.999158,-1.376706],
                    '所罗门群岛': [191.414413,-14.078193],
                    '南乔治亚岛和南桑德韦奇岛': [-43.895168, -68.2312],
                    '斯瓦尔巴岛和扬马延岛': [24.895168, 89.2312],
                    '托克劳': [220.414413,-15.078192],
                    '汤加王国': [222.959158,-28.176706],
                    '特立尼达和多巴哥共和国': [-73.195168, 10.6312],
                    '特克斯和凯科斯群岛': [-85.195168, 24.6312],
                    '图瓦卢': [213.414413,-10.078193],
                    '阿拉伯联合酋长国': [65.199158,25.776706],
                    '美国本土外小岛屿': [-186.895168, 21.2312],
                    '瓦努阿图共和国': [200.414413,-21.078193],
                    '梵蒂冈城国': [13.895168, 47.2312],
                    '英属维尔京群岛': [-74.695168, 18.9312],
                    '美属维尔京群岛': [-74.195168, 18.2312],
                    '瓦利斯和富图纳': [218.414413,-18.078192],
                    '南斯拉夫联盟共和国': [22.895168, 52.2312],
                    '美属萨摩亚': [222.414413,-22.078193],
                    '安道尔公国': [0.895168, 48.370216],
                    '安圭拉': [-71.695168, 18.9312],
                    '南极洲': [28.199158,-68.276706],
                    '安提瓜和巴布达': [-71.695168, 15.9312],
                    '阿鲁巴': [-82.695168, 11.9312],
                    '巴林国': [59.499158,29.776706],
                    '巴巴多斯': [-70.695168, 11.9312],
                    '百慕大': [-74.695168, 34.9312],
                    '布维岛': [6.199158,-61.276706],
                    '英属印度洋领地': [76.199158,-11.276706],
                    '文莱达鲁萨兰国': [139.959158,5.376706],
                    '佛得角共和国': [-28.199158,16.276706],
                    '开曼群岛': [-97.895168, 19.2312],
                    '中国香港特别行政区': [138.5823, 26.2568],
                    '中国澳门特别行政区': [135.5823, 23.2568],
                    '中国台湾特别行政区': [145.5823, 26.2568],
                    '圣诞岛': [128.999158,-16.376706],
                    '科科斯（基林）群岛': [120.999158,-19.376706],
                    '科摩罗伊斯兰联邦共和国': [51.199158,-18.276706],
                    '库克群岛': [230.414413,-27.078193],
                    '塞浦路斯共和国': [39.199158,39.276706],
                    '丹麦王国': [11.395168, 64.4312],
                    '吉布提共和国': [51.799158,11.776706],
                    '多米尼克国': [-71.695168, 13.9312],
                    '东帝汶': [151.659158,-13.376706],
                    '根西岛': [-2.895168, 56.970216],
                },
                data: [{ //动态只需要这个
                    id: 1,
                    name: '巴西'
                }, {
                    id: 2,
                    name: '美国'
                }, {
                    id: 3,
                    name: '格陵兰'
                }, {
                    id: 4,
                    name: '澳大利亚'
                }, {
                    id: 5,
                    name: '俄罗斯联邦'
                }, {
                    id: 6,
                    name: '新西兰'
                }, {
                    id: 7,
                    name: '南非'
                }
                ]
            }
        },
        methods: {
            //  全球地图生成方法
            map() {
                /**
                 * 显示点的坐标
                 */
                let geoCoordMap = this.geoCoordMap
                /**
                 * 所在点对应数据
                 * 上面数据添加修改后务必这里添加修改，value可不用
                 */
                let data = this.data

                //  生成出线方法
                function formtGCData(geoData, data, srcNam, dest) {
                    let tGeoDt = []
                    if (dest) {
                        for (let i = 0; i < data.length; i++) {
                            if (srcNam !== data[i].name) {
                                tGeoDt.push({
                                    coords: [geoData[srcNam], geoData[data[i].name]]
                                })
                            }
                        }
                    } else {
                        for (let j = 0; j < data.length; j++) {
                            if (srcNam !== data[j].name) {
                                tGeoDt.push({
                                    coords: [geoData[data[j].name], geoData[srcNam]]
                                })
                            }
                        }
                    }
                    return tGeoDt
                }

                //  生成进线方法
                function formtVData(geoData, data, srcNam) {
                    let tGeoDt = []
                    for (let i = 0; i < data.length; i++) {
                        let tNam = data[i].name
                        if (srcNam !== tNam) {
                            tGeoDt.push({
                                name: tNam,
                                value: geoData[tNam],
                                symbolSize: 3//外国涟漪大小
                            })
                        }
                    }
                    tGeoDt.push({
                        name: srcNam,
                        value: geoData[srcNam],
                        symbolSize: 3,//中国涟漪大小
                        itemStyle: {
                            normal: {
                                color: 'red',
                                borderColor: '#000'
                            }
                        }
                    })
                    return tGeoDt
                }

                let planePath = 'arrow'
                // 基于准备好的dom，初始化echarts实例
                let myChart = echarts.init(document.getElementById('demoMap'))
                // 绘制图表
                myChart.setOption({
                    title: {
                        text: 'HrjTest',
                        left: '40%',
                        top: '0px',
                        textStyle: {
                            color: '#fff',
                            opacity: 0.7
                        },
                        itemStyle: {
                            normal: {
                                borderColor: 'rgba(100,149,237,1)',
                                borderWidth: 0.5,
                                areaStyle: {
                                    color: '#fff'
                                }
                            }
                        }
                    },
                    dataRange: {
                        show: false,  //是否显示调色板
                        min: 0,
                        max: 1000,
                        text: ['High', 'Low'],
                        realtime: true,
                        calculable: true,//是否显示拖拽用的手柄（手柄能拖拽调整选中范围）。
                        color: ['orangered', 'yellow', 'lightskyblue']            //  生成地图颜色以及发散点颜色

                    },
                    tooltip: {// 鼠标移到图里面的浮动提示框
                        trigger: 'item'//出发方式
                        /*show:true, //鼠标移入是否触发数据
                        formatter:'{b}-销售数量：{c}'*/
                    },
                    geo: {
                        map: 'world',// 表示世界地图
                        label: {
                            emphasis: {
                                show: false
                            },
                            /*normal: {
                                show: true, // 是否显示对应地名
                                textStyle: {
                                    color: 'rgba(0,0,0,0.4)'
                             }*/
                        },
                        roam: false,
                        silent: true,
                        itemStyle: {
                            normal: {
                                areaColor: 'transparent',//底层色  目前透明
                                borderColor: 'transparent'//底层色边框  目前透明
                            },
                            emphasis: {
                                areaColor: 'transparent',
                                /*shadowOffsetX: 0,
                                shadowOffsetY: 0,
                                shadowBlur: 20,
                                borderWidth: 0,
                                shadowColor: 'rgba(0, 0, 0, 0.5)'*/
                            }
                        }
                    },
                    series: [{
                        /*type: 'scatter',
                        coordinateSystem: 'geo' // 对应上方配置
                        },
                        {*/
                        /*name:'地图',*/
                        type: 'map',//地图种类
                        mapType: 'world',
                        /*geoIndex: 0,*/
                        /*label: {  //图形上的文本标签，可用于说明图形的一些数据信息
                            show:true,
                        },*/
                        zoom: 1.2,//放大比例
                        name:'地名和企业数量',// 浮动框的标题
                        mapLocation: {
                            y: 100
                        },
                        itemStyle: {//地图区域的多边形 图形样式。
                            /*emphasis:{ //高亮状态下的样试
                                label:{
                                    show:true,
                                }
                            },*/
                            emphasis: {label: {show: true}}
                        },
                        // 对应生成地图颜色板块数据
                        data: [//热力数据
                            {name: '阿富汗', value: 12},
                            {name: '安哥拉', value: 14},
                            {name: '阿尔巴尼亚', value: 31},
                            {name: '阿联酋', value: 8},
                            {name: '阿根廷', value: 24},
                            {name: '亚美尼亚', value: 96},
                            {name: '法属南部领地', value: 25},
                            {name: '澳大利亚', value: 88},
                            {name: '奥地利', value: 4},
                            {name: '阿塞拜疆', value: 8},
                            {name: '布隆迪', value: 9},
                            {name: '比利时', value: 18},
                            {name: '贝宁', value: 98},
                            {name: '布基纳法索', value: 84},
                            {name: '孟加拉国', value: 12},
                            {name: '保加利亚', value: 5},
                            {name: '巴哈马', value: 6},
                            {name: '波黑', value: 38},
                            {name: '白俄罗斯', value: 997},
                            {name: '百慕大', value: 51},
                            {name: '玻利维亚', value: 79},
                            {name: '巴西', value: 19},
                            {name: '萨摩亚', value: 14},
                            {name: '文莱', value: 2},
                            {name: '不丹', value: 9},
                            {name: '博茨瓦纳', value: 19},
                            {name: '中非', value: 10},
                            {name: '加拿大', value: 24},
                            {name: '瑞士', value: 7},
                            {name: '智利', value: 6},
                            {name: '中国', value: 5000000},
                            {name: '象牙海岸', value: 6},
                            {name: '喀麦隆', value: 3},
                            {name: '刚果（金）', value: 1},
                            {name: '刚果（布）', value: 3},
                            {name: '哥伦比亚', value: 9},
                            {name: '哥斯达黎加', value: 45},
                            {name: '古巴', value: 18},
                            {name: '北塞浦路斯', value: 18},
                            {name: '塞浦路斯', value: 15},
                            {name: '捷克', value: 101},
                            {name: '德国', value: 8884},
                            {name: '吉布提', value: 36},
                            {name: '丹麦', value: 9},
                            {name: '多米尼加', value: 57},
                            {name: '多米尼加岛', value: 97},
                            {name: '阿尔及利亚', value: 37},
                            {name: '厄瓜多尔', value: 72},
                            {name: '埃及', value: 75},
                            {name: '厄立特里亚', value: 59},
                            {name: '西班牙', value: 48},
                            {name: '爱沙尼亚', value: 13},
                            {name: '埃塞俄比亚', value: 81},
                            {name: '芬兰', value: 53},
                            {name: '斐济', value: 8},
                            {name: '福克兰群岛（马尔维纳斯）', value: 41},
                            {name: '法国', value: 636},
                            {name: '加蓬', value: 152},
                            {name: '英国', value: 65},
                            {name: '格鲁吉亚', value: 44},
                            {name: '加纳', value: 21},
                            {name: '几内亚', value: 33},
                            {name: '冈比亚', value: 4},
                            {name: '奥兰群岛', value: 14},
                            {name: '安道尔', value: 4},
                            {name: '几内亚比绍', value: 3},
                            {name: '赤道几内亚', value: 697},
                            {name: '希腊', value: 119},
                            {name: '格陵兰', value: 56},
                            {name: '关岛', value: 96},
                            {name: '格林纳达', value: 16},
                            {name: '危地马', value: 16},
                            {name: '法属圭亚那', value: 29},
                            {name: '圭亚那', value: 76},
                            {name: '洪都拉斯', value: 764},
                            {name: '克罗地亚', value: 437},
                            {name: '海地', value: 9},
                            {name: '匈牙利', value: 103},
                            {name: '印度尼西亚', value: 245},
                            {name: '印度', value: 128},
                            {name: '爱尔兰', value: 61},
                            {name: '伊朗', value: 285},
                            {name: '伊拉克', value: 338},
                            {name: '冰岛', value: 342},
                            {name: '以色列', value: 748},
                            {name: '意大利', value: 678},
                            {name: '牙买加', value: 25},
                            {name: '约旦', value: 64},
                            {name: '日本', value: 613},
                            {name: '哈萨克斯坦', value: 17},
                            {name: '泽西岛', value: 27},
                            {name: '克什米尔-巴', value: 27},
                            {name: '克什米尔-印', value: 27},
                            {name: '肯尼亚', value: 44},
                            {name: '吉尔吉斯斯坦', value: 53},
                            {name: '柬埔寨', value: 11},
                            {name: '韩国', value: 52},
                            {name: '科索沃', value: 43},
                            {name: '科威特', value: 29},
                            {name: '基里巴斯', value: 2},
                            {name: '老挝', value: 63},
                            {name: '黎巴嫩', value: 42},
                            {name: '利比里亚', value: 3},
                            {name: '利比亚', value: 62},
                            {name: '列支敦士登', value: 5},
                            {name: '斯里兰卡', value: 9},
                            {name: '圣卢西亚', value: 20},
                            {name: '莱索托', value: 21},
                            {name: '立陶宛', value: 37},
                            {name: '卢森堡', value: 55},
                            {name: '拉脱维亚', value: 20},
                            {name: '摩洛哥', value: 31},
                            {name: '摩尔多瓦', value: 19},
                            {name: '马达加斯加', value: 32},
                            {name: '墨西哥', value: 14},
                            {name: '马其顿', value: 55},
                            {name: '伯利兹', value: 55},
                            {name: '马里', value: 961},
                            {name: '缅甸', value: 31},
                            {name: '黑山', value: 78},
                            {name: '蒙古', value: 27},
                            {name: '马耳他', value:.78},
                            {name: '莫桑比克', value: 235},
                            {name: '北马里亚纳', value: 23},
                            {name: '毛里塔尼亚', value: 3},
                            {name: '蒙特塞拉特', value: 2},
                            {name: '毛里求斯', value: 3},
                            {name: '马拉维', value: 6},
                            {name: '马来西亚', value: 25},
                            {name: '纳米比亚', value: 27},
                            {name: '新喀里多尼亚', value: 2},
                            {name: '英属印度洋领地', value: 29},
                            {name: '尼日尔', value: 15},
                            {name: '尼日利亚', value: 178},
                            {name: '尼加拉瓜', value: 59},
                            {name: '荷兰', value: 163},
                            {name: '挪威', value: 41},
                            {name: '尼泊尔', value: 26},
                            {name: '新西兰', value: 46},
                            {name: '阿曼', value: 28},
                            {name: '巴基斯坦', value: 6},
                            {name: '巴拿马', value: 38},
                            {name: '秘鲁', value: 2},
                            {name: '纽埃', value: 23},
                            {name: '菲律宾', value: 22},
                            {name: '巴布亚新几内亚', value: 65},
                            {name: '波兰', value: 34},
                            {name: '帕劳', value: 38},
                            {name: '波多黎各', value: 3},
                            {name: '朝鲜', value: 2},
                            {name: '葡萄牙', value: 192},
                            {name: '巴拉圭', value: 621},
                            {name: '卡塔尔', value: 173},
                            {name: '罗马尼亚', value: 276},
                            {name: '俄罗斯联邦', value: 778},
                            {name: '卢旺达', value: 132},
                            {name: '西撒哈拉', value: 58},
                            {name: '沙特阿拉伯', value: 87},
                            {name: '苏丹', value: 32},
                            {name: '南苏丹', value: 9},
                            {name: '塞内加尔', value: 14},
                            {name: '所罗门群岛', value: 7},
                            {name: '塞拉利昂', value: 5},
                            {name: '萨尔瓦多', value: 65},
                            {name: '索马里兰', value: 93},
                            {name: '索马里', value: 96},
                            {name: '塞尔维亚', value: 354},
                            {name: '苏里南', value: 56},
                            {name: '斯洛伐克', value: 57},
                            {name: '圣赫勒拿', value: 54},
                            {name: '斯洛文尼亚', value: 202},
                            {name: '圣多美和普林西比', value: 202},
                            {name: '圣皮埃尔和密克隆群岛', value: 202},
                            {name: '南乔治亚岛和南桑德韦奇岛', value: 232},
                            {name: '瑞典', value: 997},
                            {name: '斯威士兰', value: 148},
                            {name: '叙利亚', value: 74},
                            {name: '乍得', value: 11},
                            {name: '多哥', value: 634},
                            {name: '泰国', value: 616},
                            {name: '塔吉克斯坦', value: 76},
                            {name: '土库曼斯坦', value: 55},
                            {name: '东帝汶', value: 107},
                            {name: '特立尼达和多巴哥', value: 13},
                            {name: '塞舌尔', value: 13},
                            {name: '突尼斯', value: 106},
                            {name: '土耳其', value: 72},
                            {name: '坦桑尼亚', value: 449},
                            {name: '乌干达', value: 339},
                            {name: '乌克兰', value: 460},
                            {name: '乌拉圭', value: 337},
                            {name: '美国', value: 9126},
                            {name: '乌兹别克斯坦', value: 27},
                            {name: '委内瑞拉', value: 23},
                            {name: '越南', value: 890},
                            {name: '瓦努阿图', value: 23},
                            {name: '西岸', value: 13},
                            {name: '也门', value: 227},
                            {name: '南非', value: 514},
                            {name: '赞比亚', value: 132},
                            {name: '南冰洋陆地', value: 16},
                            {name: '科摩罗', value: 41},
                            {name: '巴林', value: 7},
                            {name: '巴勒斯坦', value: 76},
                            {name: '巴巴多斯', value: 76},
                            {name: '科特迪瓦', value: 57},
                            {name: '佛得角', value: 376},
                            {name: '新加坡', value: 33},
                            {name: '库拉索岛', value: 27},
                            {name: '‪赫德岛和麦克唐纳群岛', value: 87},
                            {name: '开曼群岛', value: 17},
                            {name: '法罗群岛', value: 95},
                            {name: '英国属地曼岛', value: 99},
                            {name: '法属波利尼西亚', value: 9},
                            {name: '圣文森特和格林纳丁斯', value: 9},
                            {name: '汤加', value: 97},
                            {name: '密克罗尼西亚联邦', value: 9},
                            {name: '安提瓜和巴布达', value: 11},
                            {name: '特克斯和凯科斯群岛', value: 11},
                            {name: '美属萨摩亚', value: 21},
                            {name: '津巴布韦', value: 130},
                            {name: '美属维尔京群岛', value: 130}
                        ], nameMap: {
                            'Isle of Man': '英国属地曼岛',
                            'Kashmir': '克什米尔-巴',
                            'Kashmirb': '克什米尔-印',
                            'Bahrain': '巴林',
                            'Fr. S. Antarctic Lands': '南冰洋陆地',
                            'Antigua and Barb.': '安提瓜和巴布达',
                            'American Samoa': '美属萨摩亚',
                            'Cape Verde': '佛得角',
                            'Andorra': '安道尔',
                            'Barbados': '巴巴多斯',
                            'Cayman Is.': '开曼群岛',
                            'Comoros': '科摩罗',
                            'Curaçao': '库拉索岛',
                            'Dominica': '多米尼加岛',
                            'Dominican Rep.': '多米尼加',
                            'Heard I. and McDonald Is.': '‪赫德岛和麦克唐纳群岛',
                            'Falkland Is.': '福克兰群岛（马尔维纳斯）',
                            'Faeroe Is.': '法罗群岛',
                            'Micronesia': '密克罗尼西亚联邦',
                            'Fr. Polynesia': '法属波利尼西亚',
                            'Singapore':'新加坡',
                            'Palestine':'巴勒斯坦',
                            'Bahamas':'巴哈马',
                            'Timor-Leste':'东帝汶',
                            'Afghanistan':'阿富汗',
                            'Guinea-Bissau':'几内亚比绍',
                            "Côte d'Ivoire":'科特迪瓦',
                            'Siachen Glacier':'锡亚琴冰川',
                            "Br. Indian Ocean Ter.":'英属印度洋领地',
                            'Angola':'安哥拉',
                            'Albania':'阿尔巴尼亚',
                            'United Arab Emirates':'阿联酋',
                            'Argentina':'阿根廷',
                            'Armenia':'亚美尼亚',
                            'French Southern and Antarctic Lands':'法属南部领地',
                            'Australia':'澳大利亚',
                            'Austria':'奥地利',
                            'Azerbaijan':'阿塞拜疆',
                            'Burundi':'布隆迪',
                            'Belgium':'比利时',
                            'Benin':'贝宁',
                            'Burkina Faso':'布基纳法索',
                            'Bangladesh':'孟加拉国',
                            'Bulgaria':'保加利亚',
                            'Bosnia and Herz.':'波黑',
                            'Belarus':'白俄罗斯',
                            'Belize':'伯利兹',
                            'Bermuda':'百慕大',
                            'Bolivia':'玻利维亚',
                            'Brazil':'巴西',
                            'Brunei':'文莱',
                            'Bhutan':'不丹',
                            'Botswana':'博茨瓦纳',
                            'Central African Rep.':'中非',
                            'Canada':'加拿大',
                            'Switzerland':'瑞士',
                            'Chile':'智利',
                            'China':'中国',
                            'Ivory Coast':'象牙海岸',
                            'Cameroon':'喀麦隆',
                            'Dem. Rep. Congo':'刚果（金）',
                            'Congo':'刚果（布）',
                            'Colombia':'哥伦比亚',
                            'Costa Rica':'哥斯达黎加',
                            'Cuba':'古巴',
                            'N. Cyprus':'北塞浦路斯',
                            'Cyprus':'塞浦路斯',
                            'Czech Rep.':'捷克',
                            'Germany':'德国',
                            'Djibouti':'吉布提',
                            'Denmark':'丹麦',
                            'Algeria':'阿尔及利亚',
                            'Ecuador':'厄瓜多尔',
                            'Egypt':'埃及',
                            'Eritrea':'厄立特里亚',
                            'Spain':'西班牙',
                            'Estonia':'爱沙尼亚',
                            'Ethiopia':'埃塞俄比亚',
                            'Finland':'芬兰',
                            'Fiji':'斐济',
                            'France':'法国',
                            'Gabon':'加蓬',
                            'United Kingdom':'英国',
                            'Georgia':'格鲁吉亚',
                            'Ghana':'加纳',
                            'Guinea':'几内亚',
                            'Gambia':'冈比亚',
                            'Eq. Guinea':'赤道几内亚',
                            'Greece':'希腊',
                            'Greenland':'格陵兰',
                            'Guatemala':'危地马',
                            'French Guiana':'法属圭亚那',
                            'Guyana':'圭亚那',
                            'Honduras':'洪都拉斯',
                            'Croatia':'克罗地亚',
                            'Haiti':'海地',
                            'Hungary':'匈牙利',
                            'Indonesia':'印度尼西亚',
                            'India':'印度',
                            'Ireland':'爱尔兰',
                            'Iran':'伊朗',
                            'Iraq':'伊拉克',
                            'Iceland':'冰岛',
                            'Israel':'以色列',
                            'Italy':'意大利',
                            'Jamaica':'牙买加',
                            'Jordan':'约旦',
                            'Japan':'日本',
                            'Jersey':'泽西岛',
                            'Kazakhstan':'哈萨克斯坦',
                            'Kenya':'肯尼亚',
                            'Kyrgyzstan':'吉尔吉斯斯坦',
                            'Cambodia':'柬埔寨',
                            'Korea':'韩国',
                            'Kosovo':'科索沃',
                            'Kuwait':'科威特',
                            'Kiribati':'基里巴斯',
                            'Lao PDR':'老挝',
                            'Lebanon':'黎巴嫩',
                            'Liberia':'利比里亚',
                            'Libya':'利比亚',
                            'Sri Lanka':'斯里兰卡',
                            'Saint Lucia':'圣卢西亚',
                            'Lesotho':'莱索托',
                            'Lithuania':'立陶宛',
                            'Luxembourg':'卢森堡',
                            'Latvia':'拉脱维亚',
                            'Morocco':'摩洛哥',
                            'Moldova':'摩尔多瓦',
                            'Madagascar':'马达加斯加',
                            'Mexico':'墨西哥',
                            'Macedonia':'马其顿',
                            'Mali':'马里',
                            'Myanmar':'缅甸',
                            'Montenegro':'黑山',
                            'Mongolia':'蒙古',
                            'Malta':'马耳他',
                            'Mozambique':'莫桑比克',
                            'N. Mariana Is.':'北马里亚纳',
                            'Mauritania':'毛里塔尼亚',
                            'Montserrat':'蒙特塞拉特',
                            'Mauritius':'毛里求斯',
                            'Malawi':'马拉维',
                            'Malaysia':'马来西亚',
                            'Namibia':'纳米比亚',
                            'New Caledonia':'新喀里多尼亚',
                            'Niger':'尼日尔',
                            'Nigeria':'尼日利亚',
                            'Nicaragua':'尼加拉瓜',
                            'Netherlands':'荷兰',
                            'Norway':'挪威',
                            'Nepal':'尼泊尔',
                            'New Zealand':'新西兰',
                            'Oman':'阿曼',
                            'Pakistan':'巴基斯坦',
                            'Panama':'巴拿马',
                            'Peru':'秘鲁',
                            'Niue':'纽埃',
                            'Philippines':'菲律宾',
                            'Papua New Guinea':'巴布亚新几内亚',
                            'Poland':'波兰',
                            'Palau':'帕劳',
                            'Puerto Rico':'波多黎各',
                            'Dem. Rep. Korea':'朝鲜',
                            'Portugal':'葡萄牙',
                            'Paraguay':'巴拉圭',
                            'Qatar':'卡塔尔',
                            'Romania':'罗马尼亚',
                            'Russia':'俄罗斯联邦',
                            'Rwanda':'卢旺达',
                            'W. Sahara':'西撒哈拉',
                            'Saudi Arabia':'沙特阿拉伯',
                            'Sudan':'苏丹',
                            'S. Sudan':'南苏丹',
                            'Senegal':'塞内加尔',
                            'Solomon Is.':'所罗门群岛',
                            'Sierra Leone':'塞拉利昂',
                            'El Salvador':'萨尔瓦多',
                            'Somaliland':'索马里兰',
                            'Somalia':'索马里',
                            'Serbia':'塞尔维亚',
                            'Suriname':'苏里南',
                            'Saint Helena':'圣赫勒拿',
                            'Slovakia':'斯洛伐克',
                            'Slovenia':'斯洛文尼亚',
                            'Sweden':'瑞典',
                            'Swaziland':'斯威士兰',
                            'Seychelles':'塞舌尔',
                            'Syria':'叙利亚',
                            'Chad':'乍得',
                            'Togo':'多哥',
                            'Thailand':'泰国',
                            'Tajikistan':'塔吉克斯坦',
                            'Turks and Caicos Is.':'特克斯和凯科斯群岛',
                            'Turkmenistan':'土库曼斯坦',
                            'Tonga':'汤加',
                            'East Timor':'东帝汶',
                            'Trinidad and Tobago':'特立尼达和多巴哥',
                            'Tunisia':'突尼斯',
                            'Turkey':'土耳其',
                            'Tanzania':'坦桑尼亚',
                            'Uganda':'乌干达',
                            'Ukraine':'乌克兰',
                            'Uruguay':'乌拉圭',
                            'United States':'美国',
                            'Uzbekistan':'乌兹别克斯坦',
                            'Venezuela':'委内瑞拉',
                            "São Tomé and Principe":'圣多美和普林西比',
                            "St. Pierre and Miquelon":'圣皮埃尔和密克隆群岛',
                            "S. Geo. and S. Sandw. Is.":'南乔治亚岛和南桑德韦奇岛',
                            'St. Vin. and Gren.':'圣文森特和格林纳丁斯',
                            'Vietnam':'越南',
                            'Vanuatu':'瓦努阿图',
                            'West Bank':'西岸',
                            'Yemen':'也门',
                            'South Africa':'南非',
                            'Samoa':'萨摩亚',
                            'U.S. Virgin Is.':'美属维尔京群岛',
                            'Zambia':'赞比亚',
                            'Zimbabwe':'津巴布韦',
                            'Liechtenstein': "列支敦士登",
                            'Grenada': "格林纳达",
                            'Guam': "关岛",
                            'Aland': "奥兰群岛",
                        },
                    }, {
                        /*showEffectOn: 'render',//配置什么时候显示特效
                        coordinateSystem:'geo',//该系列使用的坐标系
                        symbolSize:10,//标记的大小*/
                        type: 'lines',
                        zlevel: 2,
                        effect: {
                            show: true,
                            period: 6,
                            trailLength: 0.1,
                            color: '#db9982',
                            symbol: planePath,//箭头样式
                            symbolSize: 5//箭头大小
                        },
                        lineStyle: {
                            normal: {
                                color: '#fff',
                                width: 1,
                                opacity: 0.4,
                                curveness: 0.1
                            }
                        },
                        itemStyle: {//地图区域的多边形 图形样式。
                            normal: {
                                label: {
                                    show: true,
                                    textStyle: {
                                        color: 'rgb(249, 249, 249)'
                                    }
                                }
                            }
                        },
                        data: formtGCData(geoCoordMap, data, '中国', true)
                    }, {
                        type: 'lines',
                        color: '#000',
                        zlevel: 2,
                        effect: {
                            show: true,
                            period: 6,
                            trailLength: 0.1,
                            color: '#000',
                            //symbol: planePath,
                            symbolSize: 8
                        },
                        lineStyle: {
                            normal: {
                                color: '#fff',
                                width: 1,
                                opacity: 0.4,
                                curveness: 0.2
                            }
                        },
                        //data: formtGCData(geoCoordMap, data, '中国', false)返回路线
                    },
                        {
                            type: 'effectScatter',
                            coordinateSystem: 'geo',
                            zlevel: 2,//层级
                            rippleEffect: {
                                period: 4,
                                scale: 10,
                                brushType: 'stroke'
                            },
                            label: {
                                normal: {
                                    show: true,
                                    position: 'right',
                                    formatter: '{b}',
                                    color: '#fff',
                                    fontSize: 15
                                }
                            },
                            symbolSize: 10,
                            itemStyle: {
                                normal: {
                                    color: '#0D6695',
                                    borderColor: 'gold'
                                }
                            },
                            data: formtVData(geoCoordMap, data, '中国')
                        },
                        {
                            type: 'effectScatter',
                            coordinateSystem: 'geo',
                            zlevel: 2,
                            rippleEffect: {
                                period: 4,
                                scale: 10,
                                brushType: 'stroke'
                            },
                            symbolSize: 10,
                            itemStyle: {
                                normal: {
                                    color: '#0D6695',
                                    borderColor: 'gold'
                                }
                            },
                        }
                    ]
                })

                /*// 中国双击事件
                myChart.on('dblclick', (param) => {
                  if (param.data.name.toLowerCase() === '中国') {
                    this.$router.push('/map')
                  }
                })*/
            }
        },
        mounted() {
            this.$refs.demoMap.style.height = window.innerHeight + 'px'
            this.map()
        }
    }
</script>
<style>
    * {
        margin: 0;
        padding: 0;
    }

    body {
        font-size: 15px;
        background: url('./images/11.jpg') no-repeat;
        background-size: 100% 100%;
    }

    td {
        text-align: center
    }

    p {
        color: #fff;
    }

    #demo {
        display: flex;
        width: 100%;
        height: 100%;
        background: rgba(245, 96, 255, 0.5);
    }

    #demoMap {
        width: 100%;
        height: 100%!important;
    }

    .rContainer {
        width: 100%;
        height: 100%;
    }
</style>
